# ####################################################################

#  Created by Genus(TM) Synthesis Solution 19.12-s121_1 on Sat Aug 01 20:42:27 CST 2020

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design TopModuleWrapper

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clock]
set_clock_transition 0.4 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_0[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_1[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_2[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_inputs_3[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_II[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_II[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_II[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_en]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_LSUnitID[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_LSUnitID[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_deqEnLSU]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_enqEnLSU]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_startLSU]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_lenLSU[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_baseLSU[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_streamOutLSU_ready]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[10]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[11]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[12]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[13]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[14]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[15]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[16]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[17]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[18]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[19]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[20]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[21]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[22]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[23]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[24]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[25]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[26]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[27]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[28]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[29]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[30]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamInLSU_bits[31]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_streamInLSU_valid]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports reset]
set_input_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports clock]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_0[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_1[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_2[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_outs_3[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_idleLSU]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[8]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[9]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[10]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[11]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[12]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[13]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[14]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[15]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[16]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[17]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[18]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[19]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[20]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[21]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[22]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[23]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[24]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[25]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[26]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[27]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[28]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[29]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[30]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports {io_streamOutLSU_bits[31]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_streamOutLSU_valid]
set_output_delay -clock [get_clocks clk] -add_delay 0.0 [get_ports io_streamInLSU_ready]
set_wire_load_mode "enclosed"
